---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.Assign(Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
zh: 赋值、设置值、写入
source: html/452a6a7d-8b2b-7848-9a80-8f7065ac6614.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.Assign Method

**中文**: 赋值、设置值、写入

Assigns values of the source settings to this object.

## Syntax (C#)
```csharp
public void Assign(
	PointCloudOverrideSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings`) - The source settings.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null